'''
Расширить программу из п. 4:
а. Усовершенствовать первую функцию из предыдущего примера. Необходимо во втором списке часть строковых значений 
(выбирается случайно) заменить на значения типа 345example (в обратном порядке, число и строка). (То есть вы 
переделываете функцию записи в файл так, чтобы она иногда меняла запись на 345example)
б. Реализовать функцию поиска определенных подстрок в файле по следующим условиям: вывод первого вхождения, 
вывод всех вхождений.
в. Реализовать функцию замену всех найденных подстрок на новое значение и вывод измененных строк. (это ДВЕ 
ОТДЕЛЬНЫЕ функции которые ВЫВОДЯТ значения, не записывают и не модифицируют файлы)
'''